# 使用許諾契約書

本ソフトウェアは、袈裟丸喜嗣（Yoshitsugu Kesamaru）（以下「甲」）が著作権を保有する「JAPANESE FACE V1 ONNXモデル」および関連するコード（以下「本モデル」）であり、以下の条件に基づいて使用が許可されます。本モデルを使用する者（以下「乙」）は、以下の条件に同意するものとします。

## 研究目的および非稼働での商用利用
乙が将来的に本モデルおよび関連するコードを商用利用する予定がある場合でも、実際にまだ稼働させていない場合には、Apache License 2.0の条件に従って使用することができます。この条件は、社内での実験、研究、コンペティションへの参加、客先での試験運用、その他の非稼働用途に適用されます。

## Apache License 2.0の条文
上記の非稼働目的および研究目的の場合には、以下のApache License 2.0の条件が適用されます。
https://www.apache.org/licenses/LICENSE-2.0

## 商用利用および実稼働
乙が本モデルおよび関連するコードをクラウド、オンプレミス、IoT環境などで商用利用し、**実稼働**させる場合、乙は甲との間で別途ライセンス契約を締結する必要があります。ここで「実稼働」とは、本モデルを利用して商用サービスを提供し、金銭的利益を得ることを指します。

## 著作権
本モデルおよび関連するコードの著作権は、甲に帰属します。

## 保証の否認
本モデルおよび関連するコードは「現状のまま」提供され、いかなる明示的または黙示的な保証も含まれていません。甲は、本モデルおよび関連するコードの利用によって生じるいかなる損害についても責任を負いません。

## 公序良俗
乙は、本モデルおよび関連するコードを公序良俗に反する目的で使用することを禁止します。具体的には、暴力的、猥褻、差別的な内容を含む用途での使用を禁じますが、これらに限らずその他の公序良俗に反する用途も含まれます。

## 使用禁止の権利
甲は、乙が本ライセンスの条項に違反した場合、または乙の使用が公序良俗に反すると判断した場合に限り、本モデルおよび関連するコードの使用を禁止する権利を有します。その際、甲は乙に対して理由を説明する義務があります。

## 契約条件
乙は、本ライセンス契約に基づいて、本モデルおよび関連するコードを公序良俗に反しない形で使用することに同意します。また、契約時に定められた使用台数や用途に従って利用することを義務とします。これらの条件に違反した場合、本ライセンスは無効となる可能性があります。

## ライセンスの終了
本ライセンスは、乙が本ライセンスの条項に違反した場合、または乙の使用が公序良俗に反すると判断された場合に限り、甲が終了を通知することで無効となります。乙は通知を受けた時点で直ちに本モデルおよび関連するコードの使用を停止しなければなりません。ただし、乙がライセンス契約の条項を遵守している限り、契約期間中は本モデルおよび関連するコードを使用し続ける権利を有します。

## 他のアプリケーションとの併用
乙は、本モデルおよび関連するコードを他のアプリケーションと組み合わせて使用することができます。

## OSSの使用
本モデルおよび関連するコードにはオープンソースソフトウェア（「OSS」）が含まれており、それぞれのOSSには独自のライセンスが適用され、OSSの著作権はOSSの作者に帰属します。

## 変更の通知
甲は、本ライセンスの内容を予告なく変更することがあります。その場合、最新のライセンス内容が適用されます。

## 紛争解決
本モデルおよび関連するコードの使用に関する紛争が生じた場合、乙は裁判所に訴訟を提起せず、本モデルおよび関連するコードの使用を中止するものとします。乙は、本モデルおよび関連するコードの使用に関して一切の異議申し立てを行わないものとします。

## 連絡先
甲への連絡は以下のメールアドレスにて行ってください：
y.kesamaru@tokai-kaoninsho.com

袈裟丸喜嗣, 東海顔認証
